//Патерн "Абстрактна фабрика" надає інтерфейс для створення сімейств взаємопов'язаних або залежних об'єктів без зазначення їх конкретних класів.

using AbstractFactory;
using AbstractFactory.Factory;

Hero elf = new Hero(new ElfFactory());
elf.Hit();
elf.Run();

Hero warrior = new Hero(new WarriorFactory());
warrior.Hit();
warrior.Run();

//Таким чином, створення супергероя абстрагується від самого класу супергероя.
//У той же час не можна не відзначити і недоліки шаблону.
//Зокрема, якщо ми захочемо додати в конфігурацію супергероя новий об'єкт, наприклад, тип одягу, то доведеться переробляти класи фабрик і клас супергероя.
//Тому можливості для розширення в цьому патерні мають певні обмеження.